spec/spec/SVAP/AcquiringApplications/Examples/app_flow.example.2009.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:int="http://bpc.ru/sv/SVAP">
<soapenv:Header/>
<soapenv:Body>
<application xmlns="http://sv.bpc.in/SVAP">
	<application_type>APTPACQA</application_type>                                       <!-- Application type - Acquiring -->
 	<application_flow_id>2009</application_flow_id>                                     <!-- Application flow (business process) - Close acquirer account -->
	<application_status>APST0006</application_status>                                   <!-- Application status - Ready to process -->
	<operator_id>ADMIN</operator_id>                                                	<!-- User name who made this application -->
	<institution_id>1001</institution_id>                                               <!-- Institution identifier -->
	<agent_id>10000001</agent_id>                                                       <!-- Agent identifier -->
	<customer>
		<command>CMMDEXPR</command>                                                     <!-- Command for customer - find existing customer -->
		<customer_number>0000000000000000000697</customer_number>                       <!-- Unique customer number -->
		<contract>
			<command>CMMDEXPR</command>                                                 <!-- Command for contract - find existing contract -->
			<contract_number>00000000000000000000000000000736</contract_number>         <!-- Contract number -->
				<account id="account_1">                                                <!-- Account - value in attribute ID could be used as reference on this object -->
					<command>CMMDEXRE</command>                                         <!-- Command for account - Close existing account -->
					<account_number>40817840010009302127</account_number>               <!-- Account number  -->
				</account>				
		</contract>
	</customer>
</application>
</soapenv:Body>
</soapenv:Envelope>
